CREATE TABLE "Факультет" (
	"Код_факультета" INT,
	"Название_факультета" nvarchar2(100),
	constraint Факультет_PK PRIMARY KEY ("Код_факультета"));
----------------------------------------------------------
CREATE TABLE "Специальность" (
	"Код_факультета" INT,
	"Код_специальности" nvarchar2(10),
	"Имя_специальности" nvarchar2(100),
	constraint Специальность_PK PRIMARY KEY ("Код_специальности"));
----------------------------------------------------------
CREATE TABLE "Дисциплина" (
	"Код_специальности" nvarchar2(10),
	"Код_дисциплины" INT,
	"Наименование_дисциплины" nvarchar2(100),
	constraint Дисциплина_PK PRIMARY KEY ("Код_дисциплины"));
----------------------------------------------------------
CREATE TABLE "Преподаватель" (
	"Код_преподавателя" INT,
	"ФИО" nvarchar2(100),
	constraint Преподаватель_PK PRIMARY KEY ("Код_преподавателя"));
----------------------------------------------------------
CREATE TABLE "Лабораторные" (
	"Код_дисциплины" INT,
	"Номер_лабораторной" INT,
	"Название_лабораторной" nvarchar2(100),
	constraint Лабораторные_PK PRIMARY KEY ("Номер_лабораторной"));
----------------------------------------------------------
CREATE TABLE "Студенты" (
	"Код_студента" INT,
	"Код_подгруппы" INT,
	"ФИО" nvarchar2(100),
	constraint Студенты_PK PRIMARY KEY ("Код_студента"));
----------------------------------------------------------
CREATE TABLE "Подгруппы" (
	"Код_группы" INT,
	"Код_подгруппы" INT,
	"Номер_подгруппы" INT,
	constraint Подгруппы_PK PRIMARY KEY ("Код_подгруппы"));
----------------------------------------------------------
CREATE TABLE "Успеваемость" (
	"Код_дисциплины" INT,
	"Код_преподавателя" INT,
	"Номер_лабораторной" INT,
	"Код_студента" INT,
	"Статус_сдачи" nvarchar2(20));
----------------------------------------------------------
CREATE TABLE "Нагрузка_преподавателя" (
	"Код_подгруппы" INT,
	"Код_преподавателя" INT,
	"Код_дисциплины" INT);
----------------------------------------------------------  
CREATE TABLE "Группы" (
	"Код_группы" INT,
	"Код_специальности" nvarchar2(10),
	"Год_поступления" INT,
	"Номер_группы" INT,
	constraint Группы_PK PRIMARY KEY ("Код_группы"));
----------------------------------------------------------